// API란 무엇인가?

// API는 Application Programming Interface의 약자로 응용 프로그램에서 사용할수 있도록
// 운영체제나 프로그래밍 언어가 제공하는 기능을 제어할 수 있게 만드는 인터페이스를 뜻한다.

// API를 사용함으로써 얻을 수 있는 효과
// - 데이터 교환
//   다른 소프트웨어와 데이터를 교환할 수 있는 방법을 제공합니다.
//   API를 제공하는 프로그램에 API로 연결하면 데이터를 공유, 처리 또는 조작을 할 수 있습니다.
//   송금 서비스 앱인 토스는 데이터 교환 API를 이용해서 한 개인의 계좌 및 카드 내역 정보를 앱 내에서 확인할 수 있게 합니다.

// - 다른 소프트웨어의 기능 실행
//   다른 소프트웨어의 기능을 호출하고 실행할 수 있는 방법을 제공합니다.
//   이를 활용하여 애플리케이션은 다른 애플리케이션의 기능을 활용하여 복잡한 작업을 간편하게 수행할 수 있습니다.
//   결제가 필요한 애플리케이션에서 카카오페이, 네이버페이 및 PG사의 결제 서비스의 API를 활용하여 결제 시스템을 구축한 사례를 많이 볼 수 있습니다.

// - 서비스 접근
//   웹 서비스나 클라우드 서비스에 접근할 수 있는 방법을 제공합니다.
//   이를 통해 개발자는 다양한 서비스를 사용하여 애플리케이션 기능을 간편하게 확장할 수 있고, 성능을 개선할 수 있습니다.
//   클라우드 서비스의 시장 점유율이 가장 높은 AWS는 API로 제공하는 서비스를 액세스할 수 있게 제공하고 있습니다.
